app/controllers/transactions_controller.rb

SELECT "transactions".* FROM "transactions"
---
  def index
    render json: Transaction.all

INSERT INTO "transactions" ("transaction_description", "created_at", "updated_at") VALUES (?, ?, ?)  [["transaction_description", "test"], ["created_at", Thu, 05 Oct 2023 20:54:07.798009000 UTC +00:00], ["updated_at", Thu, 05 Oct 2023 20:54:07.798009000 UTC +00:00]]
---
  def create
    transaction = Transaction.new(transaction_params)

    if transaction.save